tiemposDeInstalacion/EquipoAlpine_tiemposInstalacion.tex
% Created 2026-05-22 Fri 15:03
% Intended LaTeX compiler: pdflatex
\documentclass[11pt, letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[spanish,mexico]{babel}
\usepackage[margin=2.3cm]{geometry}
\usepackage{graphicx}
\usepackage[export]{adjustbox}
\usepackage{caption}
\usepackage{subcaption}
\usepackage{fancyhdr}
\usepackage{lipsum}
\usepackage[shortlabels]{enumitem}
\usepackage{float}
\usepackage{multicol}

\pagestyle{fancy}
\fancyhf{}
\usepackage{array}
\usepackage{amsmath}
\usepackage{subfiles}
\usepackage{circuitikz} 
\thispagestyle{empty}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=2.5cm]{geometry}      % Márgenes decentes
\usepackage{palatino}                   % Tipografía elegante
\usepackage{xcolor}                     % Colores personalizados
\author{
\textbf{Equipo Alpine White} \\[0.5em]
Arreguín Salgado Gael Emiliano \\
López Pérez Mariana \\
Nieto Gallegos Isaac Julián\\
\textbf{Distribución elegida:} Alpine Linux
}
\date{\textit{{[}2026-04-20 Mon]}}

\title{Tiempos de instalación de las distribuciones dadas.}
\hypersetup{
 pdfauthor={Equipo Alpine White},
 pdftitle={Tiempos de instalación de las distribuciones dadas.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle

\tableofcontents

\newpage
\section{Alpine Linux}
\label{sec:org07e84c6}

\subsection{Montaje del sistema raíz}
\label{sec:org48f8db4}

El mecanismo de instalación de Alpine Linux está constituido por dos scripts alternativa:

\begin{itemize}
\item setup-alpine, el cual puede ser aplicado sobre un disco duro entero y realizará la instalación automáticamente, según las especificaciones dadas por el usuario a través de variables de entorno y preguntas interactivas del mismo script.

\item setup-disk, el cual es aplicado sobre un arbol de archivos ya montado en \textbf{/mnt}. Sobre este sistema se detectan las particiones utilizadas y se realiza la instalación sobre estas mismas.
\end{itemize}

Para nuestro caso de uso, el segundo script será el usado. Por lo que lo primero q que debemos de hacer es crear el arbol raíz en /mnt.

Montamos nuestra partición raíz sobre /mnt con:

\begin{verbatim}
mount -t ext4 <particion> /mnt
\end{verbatim}

Luego, dentro de este, creamos la carpeta /boot con:

\begin{verbatim}
mkdir -p /mnt/boot/efi
mount -t vfat <particion> /mnt/boot/efi
\end{verbatim}

Y finalmente, cargamos la partición swap con:

\begin{verbatim}
swapon <particion>
\end{verbatim}

Una vez hecho esto, tenemos preparado el arbol de archivos sobre el que se instalará el sistema operativo.
\subsection{Instalación de Alpine Linux}
\label{sec:org2038ce6}

Instalamos los siguientes paquetes por si acaso:

\begin{verbatim}
apk add grub-efi efibootmgr
\end{verbatim}

Corremos el comando:

\begin{verbatim}
BOOTLOADER=grub setup-disk -m sys /mnt
\end{verbatim}

Al finalizar, reiniciamos y elegimos la nueva entrada en nuestro sistema UEFI. El resultado final es Alpine Linux instalado en bare-metal.

El tiempo de instalación final hasta el reinicio fue: \textbf{18:57 minutos}
\subsection{Sistema instalado}
\label{sec:orge3948ff}

La versión de Alpine Linux instalada fue la más básica posible, con nada más que los paquetes por default, sin entorno gráfico ni ningún adicional.

El tiempo de arranque de esta instalación es de \textbf{26.79 segundos}, medidos desde el primer fotograma de la pantalla inicial de la UEFI. Si medimos el tiempo considerando solamente desde que el hardware le pasa el control a la partición de arranque del sistema, esto nos da \textbf{21.12 segundos}
\section{Debian}
\label{sec:org95e246a}

\subsection{Instalación de Debian}
\label{sec:orgeacf485}

La instalación de Debian es bastante sencilla, sólo hay que seguir los pasos indicados por el asistente.

El tipo de instalación elegido fue el especificado durante todo el curso: mínimo, sin interfaz gráfica y con servidor SSH habilitado.

El tiempo de instalación final hasta el reinicio fue: \textbf{22:17 minutos}
\subsection{Sistema instalado}
\label{sec:org4350345}

La versión de Debian instalada fue la más básica posible, con nada más que los paquetes por default, sin entorno gráfico ni ningún adicional, excepto por el servidor SSH.

El tiempo de arranque de esta instalación es de \textbf{23.6 segundos}, medidos desde el primer fotograma de la pantalla inicial de la UEFI. Si medimos el tiempo considerando solamente desde que el hardware le pasa el control a la partición de arranque del sistema, esto nos da \textbf{20.71 segundos}

\section{Red Hat Enterprise Linux}
\label{sec:org0c08d7e}

\subsection{Instalación de Red Hat Enterprise Linux}

La instalación de Red Hat Enterprise Linux se realizó mediante una memoria USB booteable utilizando Ventoy para cargar la imagen ISO del sistema.

El proceso de instalación se llevó a cabo con el asistente gráfico Anaconda, el cual permitió configurar de forma sencilla aspectos como idioma, distribución del teclado, zona horaria, almacenamiento y creación de usuarios.

La instalación se realizó con entorno gráfico GNOME y con los servicios básicos de red habilitados para el funcionamiento del sistema.

El tiempo total de instalación hasta el primer inicio de sesión fue de aproximadamente \textbf{20 minutos}.

\subsection{Sistema instalado}

La instalación base de Red Hat Enterprise Linux ocupó aproximadamente \textbf{9 GB} de almacenamiento, considerando únicamente los paquetes instalados por defecto.

El tiempo de arranque del sistema fue de aproximadamente \textbf{32.98 segundos}, medidos desde el encendido del equipo hasta la aparición de la pantalla de inicio de sesión gráfica.

\section{Fedora}
\label{sec:orga68a3e5}

\subsection{Administración y ampliación de almacenamiento}

En Fedora Workstation el sistema operativo ya se encontraba previamente instalado, por lo que únicamente fue necesario ampliar el espacio disponible de la partición principal hasta alcanzar \textbf{64 GB}.

Para ello, se identificaron las particiones existentes utilizando la herramienta gráfica \textbf{Disks} de GNOME y posteriormente se redimensionó la partición correspondiente al sistema Fedora, ubicada en \textbf{/dev/sda6} y configurada con el sistema de archivos \textbf{Btrfs}.

Después del redimensionamiento, se realizaron pruebas de montaje manual desde la terminal para verificar el acceso correcto al sistema de archivos y comprobar la estructura interna del sistema.

\subsection{Sistema instalado}

La instalación base de Fedora Workstation utilizó aproximadamente \textbf{18 GB} de almacenamiento, considerando el entorno gráfico y las aplicaciones preinstaladas.

El tiempo de inicio del sistema fue de aproximadamente \textbf{27 segundos}, medidos desde el encendido del equipo hasta la aparición de la pantalla de inicio de sesión gráfica.
\end{document}